In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("dog.csv")

In [3]:
df.head()

,HALTER_ID,ALTER,GESCHLECHT,STADTKREIS,STADTQUARTIER,RASSE1,RASSE1_MISCHLING,RASSE2,RASSE2_MISCHLING,RASSENTYP,GEBURTSJAHR_HUND,GESCHLECHT_HUND,HUNDEFARBE
0,126,51-60,m,9.0,92.0,Welsh Terrier,NaN,NaN,NaN,K,2011,w,schwarz/braun
1,574,61-70,w,2.0,23.0,Cairn Terrier,NaN,NaN,NaN,K,2002,w,brindle
2,695,41-50,m,6.0,63.0,Labrador Retriever,NaN,NaN,NaN,I,2012,w,braun
3,893,61-70,w,7.0,71.0,Mittelschnauzer,NaN,NaN,NaN,I,2010,w,schwarz
4,1177,51-60,m,10.0,102.0,Shih Tzu,NaN,NaN,NaN,K,2011,m,schwarz/weiss

In [4]:

data = {'Name': ['Alice', 'Bob', 'Charlie', None],
        'Age': [25, None, 30, 22]}

df = pd.DataFrame(data)
print("Original:\n", df)

# Drop rows with any missing values
df_dropped = df.dropna()
print("\nAfter dropna():\n", df_dropped)

Original:
       Name   Age
0    Alice  25.0
1      Bob   NaN
2  Charlie  30.0
3     None  22.0

After dropna():
       Name   Age
0    Alice  25.0
2  Charlie  30.0

In [5]:
dff=df.fillna({'Name':"Shree",'Age':'19'})

In [8]:
df

      Name   Age
0    Alice  25.0
1      Bob   NaN
2  Charlie  30.0
3     None  22.0

In [9]:
dff

      Name   Age
0    Alice  25.0
1      Bob    19
2  Charlie  30.0
3    Shree  22.0

In [14]:
intdf=df['Age'].interpolate()

# mean=df['Age'].mean()

In [15]:
intdf

0    25.0
1    27.5
2    30.0
3    22.0
Name: Age, dtype: float64

In [21]:
df['Age'].isna()

0    False
1     True
2    False
3    False
Name: Age, dtype: bool

In [22]:
df.isna()

    Name    Age
0  False  False
1  False   True
2  False  False
3   True  False

In [23]:
data = {'Name': ['Alice', 'Bob'], 'Age': [25, 30]}
df = pd.DataFrame(data)

# Iterate using iterrows()

In [24]:
df

    Name  Age
0  Alice   25
1    Bob   30

In [25]:
for index, row in df.iterrows():
    print(f"Index: {index}, Name: {row['Name']}, Age: {row['Age']}")

Index: 0, Name: Alice, Age: 25
Index: 1, Name: Bob, Age: 30